## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform
[command]/home/runner/work/_temp/af793eda-5925-4c49-bc39-0aca743d3f80/terraform-bin show -no-color main.tfplan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.acr.azurerm_container_registry.acr will be created
  + resource "azurerm_container_registry" "acr" {
      + admin_enabled                 = false
      + admin_password                = (sensitive value)
      + admin_username                = (known after apply)
      + encryption                    = (known after apply)
      + export_policy_enabled         = true
      + id                            = (known after apply)
      + location                      = "uksouth"
      + login_server                  = (known after apply)
      + name                          = "devfcacr"
      + network_rule_bypass_option    = "AzureServices"
      + network_rule_set              = (known after apply)
      + public_network_access_enabled = true
      + resource_group_name           = "rg-freundcloudaks"
      + retention_policy              = (known after apply)
      + sku                           = "Standard"
      + tags                          = {
          + "application" = "freundcloudaks"
          + "environment" = "dev"
          + "owner"       = "olafkfreund"
        }
      + trust_policy                  = (known after apply)
      + zone_redundancy_enabled       = false

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "UserAssigned"
        }
    }

  # module.acr_pull_role.azurerm_role_assignment.role will be created
  + resource "azurerm_role_assignment" "role" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "AcrPull"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.aks.azurerm_kubernetes_cluster.aks will be created
  + resource "azurerm_kubernetes_cluster" "aks" {
      + api_server_authorized_ip_ranges     = (known after apply)
      + current_kubernetes_version          = (known after apply)
      + dns_prefix                          = "freundcloudaks"
      + fqdn                                = (known after apply)
      + http_application_routing_zone_name  = (known after apply)
      + id                                  = (known after apply)
      + image_cleaner_enabled               = false
      + image_cleaner_interval_hours        = 48
      + kube_admin_config                   = (sensitive value)
      + kube_admin_config_raw               = (sensitive value)
      + kube_config                         = (sensitive value)
      + kube_config_raw                     = (sensitive value)
      + kubernetes_version                  = (known after apply)
      + location                            = "uksouth"
      + name                                = "freundcloudaks"
      + node_resource_group                 = (known after apply)
      + node_resource_group_id              = (known after apply)
      + oidc_issuer_url                     = (known after apply)
      + portal_fqdn                         = (known after apply)
      + private_cluster_enabled             = false
      + private_cluster_public_fqdn_enabled = false
      + private_dns_zone_id                 = (known after apply)
      + private_fqdn                        = (known after apply)
      + public_network_access_enabled       = true
      + resource_group_name                 = "rg-freundcloudaks"
      + role_based_access_control_enabled   = true
      + run_command_enabled                 = true
      + sku_tier                            = "Free"
      + support_plan                        = "KubernetesOfficial"
      + tags                                = {
          + "application" = "freundcloudaks"
          + "environment" = "dev"
          + "owner"       = "olafkfreund"
        }
      + workload_identity_enabled           = false

      + api_server_access_profile (known after apply)

      + auto_scaler_profile (known after apply)

      + default_node_pool {
          + enable_auto_scaling  = true
          + kubelet_disk_type    = (known after apply)
          + max_count            = 5
          + max_pods             = (known after apply)
          + min_count            = 1
          + name                 = "default"
          + node_count           = 3
          + node_labels          = (known after apply)
          + orchestrator_version = (known after apply)
          + os_disk_size_gb      = (known after apply)
          + os_disk_type         = "Managed"
          + os_sku               = (known after apply)
          + scale_down_mode      = "Delete"
          + type                 = "VirtualMachineScaleSets"
          + ultra_ssd_enabled    = false
          + vm_size              = "Standard_D2s_v3"
          + workload_runtime     = (known after apply)
        }

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "UserAssigned"
        }

      + kubelet_identity (known after apply)

      + linux_profile {
          + admin_username = "olafkfreund"

          + ssh_key {
              + key_data = (known after apply)
            }
        }

      + monitor_metrics {}

      + network_profile {
          + dns_service_ip          = (known after apply)
          + docker_bridge_cidr      = (known after apply)
          + ebpf_data_plane         = (known after apply)
          + ip_versions             = (known after apply)
          + load_balancer_sku       = "standard"
          + network_data_plane      = (known after apply)
          + network_mode            = (known after apply)
          + network_plugin          = "kubenet"
          + network_policy          = (known after apply)
          + outbound_ip_address_ids = (known after apply)
          + outbound_ip_prefix_ids  = (known after apply)
          + outbound_type           = "loadBalancer"
          + pod_cidr                = (known after apply)
          + pod_cidrs               = (known after apply)
          + service_cidr            = (known after apply)
          + service_cidrs           = (known after apply)

          + load_balancer_profile (known after apply)

          + nat_gateway_profile (known after apply)
        }

      + windows_profile (known after apply)

      + workload_autoscaler_profile {
          + keda_enabled                              = true
          + vertical_pod_autoscaler_controlled_values = (known after apply)
          + vertical_pod_autoscaler_enabled           = false
          + vertical_pod_autoscaler_update_mode       = (known after apply)
        }
    }

  # module.am-dce.azurerm_monitor_data_collection_endpoint.dce will be created
  + resource "azurerm_monitor_data_collection_endpoint" "dce" {
      + configuration_access_endpoint = (known after apply)
      + id                            = (known after apply)
      + immutable_id                  = (known after apply)
      + kind                          = "Linux"
      + location                      = "uksouth"
      + logs_ingestion_endpoint       = (known after apply)
      + name                          = "MSProm-uksouth-freundcloudaks"
      + public_network_access_enabled = true
      + resource_group_name           = "rg-freundcloudaks"
    }

  # module.am-dcr.azurerm_monitor_data_collection_rule.dcr will be created
  + resource "azurerm_monitor_data_collection_rule" "dcr" {
      + data_collection_endpoint_id = (known after apply)
      + description                 = "DCR for Azure Monitor Metrics Profile (Managed Prometheus)"
      + id                          = (known after apply)
      + immutable_id                = (known after apply)
      + kind                        = "Linux"
      + location                    = "uksouth"
      + name                        = "MSProm-uksouth-freundcloudaks"
      + resource_group_name         = "rg-freundcloudaks"

      + data_flow {
          + destinations = [
              + "dev-amw-freundcloudaks",
            ]
          + streams      = [
              + "Microsoft-PrometheusMetrics",
            ]
        }

      + data_sources {
          + prometheus_forwarder {
              + name    = "PrometheusDataSource"
              + streams = [
                  + "Microsoft-PrometheusMetrics",
                ]
            }
        }

      + destinations {
          + monitor_account {
              + monitor_account_id = (known after apply)
              + name               = "dev-amw-freundcloudaks"
            }
        }
    }

  # module.am-dcr.azurerm_monitor_data_collection_rule_association.dcra will be created
  + resource "azurerm_monitor_data_collection_rule_association" "dcra" {
      + data_collection_rule_id = (known after apply)
      + description             = "Association of DCR. Deleting this association will break the data collection for this AKS Cluster"
      + id                      = (known after apply)
      + name                    = "dcra-dcr-prometheus-aks"
      + target_resource_id      = (known after apply)
    }

  # module.azure-monitor-workspace.azurerm_monitor_workspace.workspace will be created
  + resource "azurerm_monitor_workspace" "workspace" {
      + default_data_collection_endpoint_id = (known after apply)
      + default_data_collection_rule_id     = (known after apply)
      + id                                  = (known after apply)
      + location                            = "uksouth"
      + name                                = "dev-amw-freundcloudaks"
      + public_network_access_enabled       = true
      + query_endpoint                      = (known after apply)
      + resource_group_name                 = "rg-freundcloudaks"
      + tags                                = {
          + "application" = "freundcloudaks"
          + "environment" = "dev"
          + "owner"       = "olafkfreund"
        }
    }

  # module.dapr-extension.azurerm_kubernetes_cluster_extension.ext will be created
  + resource "azurerm_kubernetes_cluster_extension" "ext" {
      + aks_assigned_identity = (known after apply)
      + cluster_id            = (known after apply)
      + current_version       = (known after apply)
      + extension_type        = "Microsoft.Dapr"
      + id                    = (known after apply)
      + name                  = "dapr"
      + release_namespace     = (known after apply)
      + release_train         = "Stable"
      + target_namespace      = (known after apply)
    }

  # module.grafana_admin_role.azurerm_role_assignment.role will be created
  + resource "azurerm_role_assignment" "role" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_type                   = "User"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Grafana Admin"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.managed-grafana.azurerm_dashboard_grafana.grafana will be created
  + resource "azurerm_dashboard_grafana" "grafana" {
      + api_key_enabled                        = false
      + auto_generated_domain_name_label_scope = "TenantReuse"
      + deterministic_outbound_ip_enabled      = false
      + endpoint                               = (known after apply)
      + grafana_major_version                  = "10"
      + grafana_version                        = (known after apply)
      + id                                     = (known after apply)
      + location                               = "uksouth"
      + name                                   = "dev-grafana-fcaks"
      + outbound_ip                            = (known after apply)
      + public_network_access_enabled          = true
      + resource_group_name                    = "rg-freundcloudaks"
      + sku                                    = "Standard"
      + tags                                   = {
          + "application" = "freundcloudaks"
          + "environment" = "dev"
          + "owner"       = "olafkfreund"
        }
      + zone_redundancy_enabled                = false

      + azure_monitor_workspace_integrations {
          + resource_id = (known after apply)
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }
    }

  # module.monitoring_data_reader_role.azurerm_role_assignment.role will be created
  + resource "azurerm_role_assignment" "role" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Monitoring Data Reader"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.network_contributor_role.azurerm_role_assignment.role will be created
  + resource "azurerm_role_assignment" "role" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Network Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.resource-group.azurerm_resource_group.rg will be created
  + resource "azurerm_resource_group" "rg" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "rg-freundcloudaks"
      + tags     = {
          + "application" = "freundcloudaks"
          + "environment" = "dev"
          + "owner"       = "olafkfreund"
        }
    }

  # module.rule-groups.azurerm_monitor_alert_prometheus_rule_group.kubernetes_recording_rules_rule_group will be created
  + resource "azurerm_monitor_alert_prometheus_rule_group" "kubernetes_recording_rules_rule_group" {
      + cluster_name        = "freundcloudaks"
      + description         = "Kubernetes Recording Rules Rule Group"
      + id                  = (known after apply)
      + interval            = "PT1M"
      + location            = "uksouth"
      + name                = "KubernetesRecordingRulesRuleGroup-freundcloudaks"
      + resource_group_name = "rg-freundcloudaks"
      + rule_group_enabled  = true
      + scopes              = (known after apply)

      + rule {
          + enabled    = true
          + expression = <<-EOT
                sum by (cluster, namespace, pod, container) (  irate(container_cpu_usage_seconds_total{job="cadvisor", image!=""}[5m])) * on (cluster, namespace, pod) group_left(node) topk by (cluster, namespace, pod) (  1, max by(cluster, namespace, pod, node) (kube_pod_info{node!=""}))
            EOT
          + record     = "node_namespace_pod_container:container_cpu_usage_seconds_total:sum_irate"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                container_memory_working_set_bytes{job="cadvisor", image!=""}* on (namespace, pod) group_left(node) topk by(namespace, pod) (1,  max by(namespace, pod, node) (kube_pod_info{node!=""}))
            EOT
          + record     = "node_namespace_pod_container:container_memory_working_set_bytes"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                container_memory_rss{job="cadvisor", image!=""}* on (namespace, pod) group_left(node) topk by(namespace, pod) (1,  max by(namespace, pod, node) (kube_pod_info{node!=""}))
            EOT
          + record     = "node_namespace_pod_container:container_memory_rss"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                container_memory_cache{job="cadvisor", image!=""}* on (namespace, pod) group_left(node) topk by(namespace, pod) (1,  max by(namespace, pod, node) (kube_pod_info{node!=""}))
            EOT
          + record     = "node_namespace_pod_container:container_memory_cache"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                container_memory_swap{job="cadvisor", image!=""}* on (namespace, pod) group_left(node) topk by(namespace, pod) (1,  max by(namespace, pod, node) (kube_pod_info{node!=""}))
            EOT
          + record     = "node_namespace_pod_container:container_memory_swap"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                kube_pod_container_resource_requests{resource="memory",job="kube-state-metrics"}  * on (namespace, pod, cluster)group_left() max by (namespace, pod, cluster) (  (kube_pod_status_phase{phase=~"Pending|Running"} == 1))
            EOT
          + record     = "cluster:namespace:pod_memory:active:kube_pod_container_resource_requests"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                sum by (namespace, cluster) (    sum by (namespace, pod, cluster) (        max by (namespace, pod, container, cluster) (          kube_pod_container_resource_requests{resource="memory",job="kube-state-metrics"}        ) * on(namespace, pod, cluster) group_left() max by (namespace, pod, cluster) (          kube_pod_status_phase{phase=~"Pending|Running"} == 1        )    ))
            EOT
          + record     = "namespace_memory:kube_pod_container_resource_requests:sum"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                kube_pod_container_resource_requests{resource="cpu",job="kube-state-metrics"}  * on (namespace, pod, cluster)group_left() max by (namespace, pod, cluster) (  (kube_pod_status_phase{phase=~"Pending|Running"} == 1))
            EOT
          + record     = "cluster:namespace:pod_cpu:active:kube_pod_container_resource_requests"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                sum by (namespace, cluster) (    sum by (namespace, pod, cluster) (        max by (namespace, pod, container, cluster) (          kube_pod_container_resource_requests{resource="cpu",job="kube-state-metrics"}        ) * on(namespace, pod, cluster) group_left() max by (namespace, pod, cluster) (          kube_pod_status_phase{phase=~"Pending|Running"} == 1        )    ))
            EOT
          + record     = "namespace_cpu:kube_pod_container_resource_requests:sum"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                kube_pod_container_resource_limits{resource="memory",job="kube-state-metrics"}  * on (namespace, pod, cluster)group_left() max by (namespace, pod, cluster) (  (kube_pod_status_phase{phase=~"Pending|Running"} == 1))
            EOT
          + record     = "cluster:namespace:pod_memory:active:kube_pod_container_resource_limits"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                sum by (namespace, cluster) (    sum by (namespace, pod, cluster) (        max by (namespace, pod, container, cluster) (          kube_pod_container_resource_limits{resource="memory",job="kube-state-metrics"}        ) * on(namespace, pod, cluster) group_left() max by (namespace, pod, cluster) (          kube_pod_status_phase{phase=~"Pending|Running"} == 1        )    ))
            EOT
          + record     = "namespace_memory:kube_pod_container_resource_limits:sum"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                kube_pod_container_resource_limits{resource="cpu",job="kube-state-metrics"}  * on (namespace, pod, cluster)group_left() max by (namespace, pod, cluster) ( (kube_pod_status_phase{phase=~"Pending|Running"} == 1) )
            EOT
          + record     = "cluster:namespace:pod_cpu:active:kube_pod_container_resource_limits"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                sum by (namespace, cluster) (    sum by (namespace, pod, cluster) (        max by (namespace, pod, container, cluster) (          kube_pod_container_resource_limits{resource="cpu",job="kube-state-metrics"}        ) * on(namespace, pod, cluster) group_left() max by (namespace, pod, cluster) (          kube_pod_status_phase{phase=~"Pending|Running"} == 1        )    ))
            EOT
          + record     = "namespace_cpu:kube_pod_container_resource_limits:sum"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                max by (cluster, namespace, workload, pod) (  label_replace(    label_replace(      kube_pod_owner{job="kube-state-metrics", owner_kind="ReplicaSet"},      "replicaset", "$1", "owner_name", "(.*)"    ) * on(replicaset, namespace) group_left(owner_name) topk by(replicaset, namespace) (      1, max by (replicaset, namespace, owner_name) (        kube_replicaset_owner{job="kube-state-metrics"}      )    ),    "workload", "$1", "owner_name", "(.*)"  ))
            EOT
          + labels     = {
              + "workload_type" = "deployment"
            }
          + record     = "namespace_workload_pod:kube_pod_owner:relabel"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                max by (cluster, namespace, workload, pod) (  label_replace(    kube_pod_owner{job="kube-state-metrics", owner_kind="DaemonSet"},    "workload", "$1", "owner_name", "(.*)"  ))
            EOT
          + labels     = {
              + "workload_type" = "daemonset"
            }
          + record     = "namespace_workload_pod:kube_pod_owner:relabel"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                max by (cluster, namespace, workload, pod) (  label_replace(    kube_pod_owner{job="kube-state-metrics", owner_kind="StatefulSet"},    "workload", "$1", "owner_name", "(.*)"  ))
            EOT
          + labels     = {
              + "workload_type" = "statefulset"
            }
          + record     = "namespace_workload_pod:kube_pod_owner:relabel"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                max by (cluster, namespace, workload, pod) (  label_replace(    kube_pod_owner{job="kube-state-metrics", owner_kind="Job"},    "workload", "$1", "owner_name", "(.*)"  ))
            EOT
          + labels     = {
              + "workload_type" = "job"
            }
          + record     = "namespace_workload_pod:kube_pod_owner:relabel"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                sum(  node_memory_MemAvailable_bytes{job="node"} or  (    node_memory_Buffers_bytes{job="node"} +    node_memory_Cached_bytes{job="node"} +    node_memory_MemFree_bytes{job="node"} +    node_memory_Slab_bytes{job="node"}  )) by (cluster)
            EOT
          + record     = ":node_memory_MemAvailable_bytes:sum"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                sum(rate(node_cpu_seconds_total{job="node",mode!="idle",mode!="iowait",mode!="steal"}[5m])) by (cluster) /count(sum(node_cpu_seconds_total{job="node"}) by (cluster, instance, cpu)) by (cluster)
            EOT
          + record     = "cluster:node_cpu:ratio_rate5m"
        }
    }

  # module.rule-groups.azurerm_monitor_alert_prometheus_rule_group.node_recording_rules_rule_group will be created
  + resource "azurerm_monitor_alert_prometheus_rule_group" "node_recording_rules_rule_group" {
      + cluster_name        = "freundcloudaks"
      + description         = "Node Recording Rules Rule Group"
      + id                  = (known after apply)
      + interval            = "PT1M"
      + location            = "uksouth"
      + name                = "NodeRecordingRulesRuleGroup-freundcloudaks"
      + resource_group_name = "rg-freundcloudaks"
      + rule_group_enabled  = true
      + scopes              = (known after apply)

      + rule {
          + enabled    = true
          + expression = <<-EOT
                count without (cpu, mode) (  node_cpu_seconds_total{job="node",mode="idle"})
            EOT
          + record     = "instance:node_num_cpu:sum"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                1 - avg without (cpu) (  sum without (mode) (rate(node_cpu_seconds_total{job="node", mode=~"idle|iowait|steal"}[5m])))
            EOT
          + record     = "instance:node_cpu_utilisation:rate5m"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                (  node_load1{job="node"}/  instance:node_num_cpu:sum{job="node"})
            EOT
          + record     = "instance:node_load1_per_cpu:ratio"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                1 - (  (    node_memory_MemAvailable_bytes{job="node"}    or    (      node_memory_Buffers_bytes{job="node"}      +      node_memory_Cached_bytes{job="node"}      +      node_memory_MemFree_bytes{job="node"}      +      node_memory_Slab_bytes{job="node"}    )  )/  node_memory_MemTotal_bytes{job="node"})
            EOT
          + record     = "instance:node_memory_utilisation:ratio"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                rate(node_vmstat_pgmajfault{job="node"}[5m])
            EOT
          + record     = "instance:node_vmstat_pgmajfault:rate5m"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                rate(node_disk_io_time_seconds_total{job="node", device!=""}[5m])
            EOT
          + record     = "instance_device:node_disk_io_time_seconds:rate5m"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                rate(node_disk_io_time_weighted_seconds_total{job="node", device!=""}[5m])
            EOT
          + record     = "instance_device:node_disk_io_time_weighted_seconds:rate5m"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                sum without (device) (  rate(node_network_receive_bytes_total{job="node", device!="lo"}[5m]))
            EOT
          + record     = "instance:node_network_receive_bytes_excluding_lo:rate5m"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                sum without (device) (  rate(node_network_transmit_bytes_total{job="node", device!="lo"}[5m]))
            EOT
          + record     = "instance:node_network_transmit_bytes_excluding_lo:rate5m"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                sum without (device) (  rate(node_network_receive_drop_total{job="node", device!="lo"}[5m]))
            EOT
          + record     = "instance:node_network_receive_drop_excluding_lo:rate5m"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                sum without (device) (  rate(node_network_transmit_drop_total{job="node", device!="lo"}[5m]))
            EOT
          + record     = "instance:node_network_transmit_drop_excluding_lo:rate5m"
        }
    }

  # module.ssh-key.azapi_resource.ssh_public_key will be created
  + resource "azapi_resource" "ssh_public_key" {
      + body                      = jsonencode({})
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + location                  = "uksouth"
      + name                      = (known after apply)
      + output                    = (known after apply)
      + parent_id                 = (known after apply)
      + removing_special_chars    = false
      + schema_validation_enabled = true
      + type                      = "Microsoft.Compute/sshPublicKeys@2022-11-01"
    }

  # module.ssh-key.azapi_resource_action.ssh_public_key_gen will be created
  + resource "azapi_resource_action" "ssh_public_key_gen" {
      + action                 = "generateKeyPair"
      + id                     = (known after apply)
      + method                 = "POST"
      + output                 = (known after apply)
      + resource_id            = (known after apply)
      + response_export_values = [
          + "publicKey",
          + "privateKey",
        ]
      + type                   = "Microsoft.Compute/sshPublicKeys@2022-11-01"
      + when                   = "apply"
    }

  # module.ssh-key.random_pet.ssh_key_name will be created
  + resource "random_pet" "ssh_key_name" {
      + id        = (known after apply)
      + length    = 2
      + prefix    = "ssh"
        # (1 unchanged attribute hidden)
    }

  # module.user_assigned_identity.azurerm_user_assigned_identity.msi will be created
  + resource "azurerm_user_assigned_identity" "msi" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = "uksouth"
      + name                = "uai-olafkfreund-dev"
      + principal_id        = (known after apply)
      + resource_group_name = "rg-freundcloudaks"
      + tags                = {
          + "application" = "freundcloudaks"
          + "environment" = "dev"
          + "owner"       = "olafkfreund"
        }
      + tenant_id           = (known after apply)
    }

Plan: 19 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + kube_config         = (sensitive value)
  + resource_group_name = "rg-freundcloudaks"
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # module.acr.azurerm_container_registry.acr will be created%0A  + resource "azurerm_container_registry" "acr" {%0A      + admin_enabled                 = false%0A      + admin_password                = (sensitive value)%0A      + admin_username                = (known after apply)%0A      + encryption                    = (known after apply)%0A      + export_policy_enabled         = true%0A      + id                            = (known after apply)%0A      + location                      = "uksouth"%0A      + login_server                  = (known after apply)%0A      + name                          = "devfcacr"%0A      + network_rule_bypass_option    = "AzureServices"%0A      + network_rule_set              = (known after apply)%0A      + public_network_access_enabled = true%0A      + resource_group_name           = "rg-freundcloudaks"%0A      + retention_policy              = (known after apply)%0A      + sku                           = "Standard"%0A      + tags                          = {%0A          + "application" = "freundcloudaks"%0A          + "environment" = "dev"%0A          + "owner"       = "olafkfreund"%0A        }%0A      + trust_policy                  = (known after apply)%0A      + zone_redundancy_enabled       = false%0A%0A      + identity {%0A          + identity_ids = (known after apply)%0A          + principal_id = (known after apply)%0A          + tenant_id    = (known after apply)%0A          + type         = "UserAssigned"%0A        }%0A    }%0A%0A  # module.acr_pull_role.azurerm_role_assignment.role will be created%0A  + resource "azurerm_role_assignment" "role" {%0A      + id                               = (known after apply)%0A      + name                             = (known after apply)%0A      + principal_id                     = (known after apply)%0A      + principal_type                   = "ServicePrincipal"%0A      + role_definition_id               = (known after apply)%0A      + role_definition_name             = "AcrPull"%0A      + scope                            = (known after apply)%0A      + skip_service_principal_aad_check = (known after apply)%0A    }%0A%0A  # module.aks.azurerm_kubernetes_cluster.aks will be created%0A  + resource "azurerm_kubernetes_cluster" "aks" {%0A      + api_server_authorized_ip_ranges     = (known after apply)%0A      + current_kubernetes_version          = (known after apply)%0A      + dns_prefix                          = "freundcloudaks"%0A      + fqdn                                = (known after apply)%0A      + http_application_routing_zone_name  = (known after apply)%0A      + id                                  = (known after apply)%0A      + image_cleaner_enabled               = false%0A      + image_cleaner_interval_hours        = 48%0A      + kube_admin_config                   = (sensitive value)%0A      + kube_admin_config_raw               = (sensitive value)%0A      + kube_config                         = (sensitive value)%0A      + kube_config_raw                     = (sensitive value)%0A      + kubernetes_version                  = (known after apply)%0A      + location                            = "uksouth"%0A      + name                                = "freundcloudaks"%0A      + node_resource_group                 = (known after apply)%0A      + node_resource_group_id              = (known after apply)%0A      + oidc_issuer_url                     = (known after apply)%0A      + portal_fqdn                         = (known after apply)%0A      + private_cluster_enabled             = false%0A      + private_cluster_public_fqdn_enabled = false%0A      + private_dns_zone_id                 = (known after apply)%0A      + private_fqdn                        = (known after apply)%0A      + public_network_access_enabled       = true%0A      + resource_group_name                 = "rg-freundcloudaks"%0A      + role_based_access_control_enabled   = true%0A      + run_command_enabled                 = true%0A      + sku_tier                            = "Free"%0A      + support_plan                        = "KubernetesOfficial"%0A      + tags                                = {%0A          + "application" = "freundcloudaks"%0A          + "environment" = "dev"%0A          + "owner"       = "olafkfreund"%0A        }%0A      + workload_identity_enabled           = false%0A%0A      + api_server_access_profile (known after apply)%0A%0A      + auto_scaler_profile (known after apply)%0A%0A      + default_node_pool {%0A          + enable_auto_scaling  = true%0A          + kubelet_disk_type    = (known after apply)%0A          + max_count            = 5%0A          + max_pods             = (known after apply)%0A          + min_count            = 1%0A          + name                 = "default"%0A          + node_count           = 3%0A          + node_labels          = (known after apply)%0A          + orchestrator_version = (known after apply)%0A          + os_disk_size_gb      = (known after apply)%0A          + os_disk_type         = "Managed"%0A          + os_sku               = (known after apply)%0A          + scale_down_mode      = "Delete"%0A          + type                 = "VirtualMachineScaleSets"%0A          + ultra_ssd_enabled    = false%0A          + vm_size              = "Standard_D2s_v3"%0A          + workload_runtime     = (known after apply)%0A        }%0A%0A      + identity {%0A          + identity_ids = (known after apply)%0A          + principal_id = (known after apply)%0A          + tenant_id    = (known after apply)%0A          + type         = "UserAssigned"%0A        }%0A%0A      + kubelet_identity (known after apply)%0A%0A      + linux_profile {%0A          + admin_username = "olafkfreund"%0A%0A          + ssh_key {%0A              + key_data = (known after apply)%0A            }%0A        }%0A%0A      + monitor_metrics {}%0A%0A      + network_profile {%0A          + dns_service_ip          = (known after apply)%0A          + docker_bridge_cidr      = (known after apply)%0A          + ebpf_data_plane         = (known after apply)%0A          + ip_versions             = (known after apply)%0A          + load_balancer_sku       = "standard"%0A          + network_data_plane      = (known after apply)%0A          + network_mode            = (known after apply)%0A          + network_plugin          = "kubenet"%0A          + network_policy          = (known after apply)%0A          + outbound_ip_address_ids = (known after apply)%0A          + outbound_ip_prefix_ids  = (known after apply)%0A          + outbound_type           = "loadBalancer"%0A          + pod_cidr                = (known after apply)%0A          + pod_cidrs               = (known after apply)%0A          + service_cidr            = (known after apply)%0A          + service_cidrs           = (known after apply)%0A%0A          + load_balancer_profile (known after apply)%0A%0A          + nat_gateway_profile (known after apply)%0A        }%0A%0A      + windows_profile (known after apply)%0A%0A      + workload_autoscaler_profile {%0A          + keda_enabled                              = true%0A          + vertical_pod_autoscaler_controlled_values = (known after apply)%0A          + vertical_pod_autoscaler_enabled           = false%0A          + vertical_pod_autoscaler_update_mode       = (known after apply)%0A        }%0A    }%0A%0A  # module.am-dce.azurerm_monitor_data_collection_endpoint.dce will be created%0A  + resource "azurerm_monitor_data_collection_endpoint" "dce" {%0A      + configuration_access_endpoint = (known after apply)%0A      + id                            = (known after apply)%0A      + immutable_id                  = (known after apply)%0A      + kind                          = "Linux"%0A      + location                      = "uksouth"%0A      + logs_ingestion_endpoint       = (known after apply)%0A      + name                          = "MSProm-uksouth-freundcloudaks"%0A      + public_network_access_enabled = true%0A      + resource_group_name           = "rg-freundcloudaks"%0A    }%0A%0A  # module.am-dcr.azurerm_monitor_data_collection_rule.dcr will be created%0A  + resource "azurerm_monitor_data_collection_rule" "dcr" {%0A      + data_collection_endpoint_id = (known after apply)%0A      + description                 = "DCR for Azure Monitor Metrics Profile (Managed Prometheus)"%0A      + id                          = (known after apply)%0A      + immutable_id                = (known after apply)%0A      + kind                        = "Linux"%0A      + location                    = "uksouth"%0A      + name                        = "MSProm-uksouth-freundcloudaks"%0A      + resource_group_name         = "rg-freundcloudaks"%0A%0A      + data_flow {%0A          + destinations = [%0A              + "dev-amw-freundcloudaks",%0A            ]%0A          + streams      = [%0A              + "Microsoft-PrometheusMetrics",%0A            ]%0A        }%0A%0A      + data_sources {%0A          + prometheus_forwarder {%0A              + name    = "PrometheusDataSource"%0A              + streams = [%0A                  + "Microsoft-PrometheusMetrics",%0A                ]%0A            }%0A        }%0A%0A      + destinations {%0A          + monitor_account {%0A              + monitor_account_id = (known after apply)%0A              + name               = "dev-amw-freundcloudaks"%0A            }%0A        }%0A    }%0A%0A  # module.am-dcr.azurerm_monitor_data_collection_rule_association.dcra will be created%0A  + resource "azurerm_monitor_data_collection_rule_association" "dcra" {%0A      + data_collection_rule_id = (known after apply)%0A      + description             = "Association of DCR. Deleting this association will break the data collection for this AKS Cluster"%0A      + id                      = (known after apply)%0A      + name                    = "dcra-dcr-prometheus-aks"%0A      + target_resource_id      = (known after apply)%0A    }%0A%0A  # module.azure-monitor-workspace.azurerm_monitor_workspace.workspace will be created%0A  + resource "azurerm_monitor_workspace" "workspace" {%0A      + default_data_collection_endpoint_id = (known after apply)%0A      + default_data_collection_rule_id     = (known after apply)%0A      + id                                  = (known after apply)%0A      + location                            = "uksouth"%0A      + name                                = "dev-amw-freundcloudaks"%0A      + public_network_access_enabled       = true%0A      + query_endpoint                      = (known after apply)%0A      + resource_group_name                 = "rg-freundcloudaks"%0A      + tags                                = {%0A          + "application" = "freundcloudaks"%0A          + "environment" = "dev"%0A          + "owner"       = "olafkfreund"%0A        }%0A    }%0A%0A  # module.dapr-extension.azurerm_kubernetes_cluster_extension.ext will be created%0A  + resource "azurerm_kubernetes_cluster_extension" "ext" {%0A      + aks_assigned_identity = (known after apply)%0A      + cluster_id            = (known after apply)%0A      + current_version       = (known after apply)%0A      + extension_type        = "Microsoft.Dapr"%0A      + id                    = (known after apply)%0A      + name                  = "dapr"%0A      + release_namespace     = (known after apply)%0A      + release_train         = "Stable"%0A      + target_namespace      = (known after apply)%0A    }%0A%0A  # module.grafana_admin_role.azurerm_role_assignment.role will be created%0A  + resource "azurerm_role_assignment" "role" {%0A      + id                               = (known after apply)%0A      + name                             = (known after apply)%0A      + principal_type                   = "User"%0A      + role_definition_id               = (known after apply)%0A      + role_definition_name             = "Grafana Admin"%0A      + scope                            = (known after apply)%0A      + skip_service_principal_aad_check = (known after apply)%0A        # (1 unchanged attribute hidden)%0A    }%0A%0A  # module.managed-grafana.azurerm_dashboard_grafana.grafana will be created%0A  + resource "azurerm_dashboard_grafana" "grafana" {%0A      + api_key_enabled                        = false%0A      + auto_generated_domain_name_label_scope = "TenantReuse"%0A      + deterministic_outbound_ip_enabled      = false%0A      + endpoint                               = (known after apply)%0A      + grafana_major_version                  = "10"%0A      + grafana_version                        = (known after apply)%0A      + id                                     = (known after apply)%0A      + location                               = "uksouth"%0A      + name                                   = "dev-grafana-fcaks"%0A      + outbound_ip                            = (known after apply)%0A      + public_network_access_enabled          = true%0A      + resource_group_name                    = "rg-freundcloudaks"%0A      + sku                                    = "Standard"%0A      + tags                                   = {%0A          + "application" = "freundcloudaks"%0A          + "environment" = "dev"%0A          + "owner"       = "olafkfreund"%0A        }%0A      + zone_redundancy_enabled                = false%0A%0A      + azure_monitor_workspace_integrations {%0A          + resource_id = (known after apply)%0A        }%0A%0A      + identity {%0A          + principal_id = (known after apply)%0A          + tenant_id    = (known after apply)%0A          + type         = "SystemAssigned"%0A        }%0A    }%0A%0A  # module.monitoring_data_reader_role.azurerm_role_assignment.role will be created%0A  + resource "azurerm_role_assignment" "role" {%0A      + id                               = (known after apply)%0A      + name                             = (known after apply)%0A      + principal_id                     = (known after apply)%0A      + principal_type                   = "ServicePrincipal"%0A      + role_definition_id               = (known after apply)%0A      + role_definition_name             = "Monitoring Data Reader"%0A      + scope                            = (known after apply)%0A      + skip_service_principal_aad_check = (known after apply)%0A    }%0A%0A  # module.network_contributor_role.azurerm_role_assignment.role will be created%0A  + resource "azurerm_role_assignment" "role" {%0A      + id                               = (known after apply)%0A      + name                             = (known after apply)%0A      + principal_id                     = (known after apply)%0A      + principal_type                   = "ServicePrincipal"%0A      + role_definition_id               = (known after apply)%0A      + role_definition_name             = "Network Contributor"%0A      + scope                            = (known after apply)%0A      + skip_service_principal_aad_check = (known after apply)%0A    }%0A%0A  # module.resource-group.azurerm_resource_group.rg will be created%0A  + resource "azurerm_resource_group" "rg" {%0A      + id       = (known after apply)%0A      + location = "uksouth"%0A      + name     = "rg-freundcloudaks"%0A      + tags     = {%0A          + "application" = "freundcloudaks"%0A          + "environment" = "dev"%0A          + "owner"       = "olafkfreund"%0A        }%0A    }%0A%0A  # module.rule-groups.azurerm_monitor_alert_prometheus_rule_group.kubernetes_recording_rules_rule_group will be created%0A  + resource "azurerm_monitor_alert_prometheus_rule_group" "kubernetes_recording_rules_rule_group" {%0A      + cluster_name        = "freundcloudaks"%0A      + description         = "Kubernetes Recording Rules Rule Group"%0A      + id                  = (known after apply)%0A      + interval            = "PT1M"%0A      + location            = "uksouth"%0A      + name                = "KubernetesRecordingRulesRuleGroup-freundcloudaks"%0A      + resource_group_name = "rg-freundcloudaks"%0A      + rule_group_enabled  = true%0A      + scopes              = (known after apply)%0A%0A      + rule {%0A          + enabled    = true%0A          + expression = <<-EOT%0A                sum by (cluster, namespace, pod, container) (  irate(container_cpu_usage_seconds_total{job="cadvisor", image!=""}[5m])) * on (cluster, namespace, pod) group_left(node) topk by (cluster, namespace, pod) (  1, max by(cluster, namespace, pod, node) (kube_pod_info{node!=""}))%0A            EOT%0A          + record     = "node_namespace_pod_container:container_cpu_usage_seconds_total:sum_irate"%0A        }%0A      + rule {%0A          + enabled    = true%0A          + expression = <<-EOT%0A                container_memory_working_set_bytes{job="cadvisor", image!=""}* on (namespace, pod) group_left(node) topk by(namespace, pod) (1,  max by(namespace, pod, node) (kube_pod_info{node!=""}))%0A            EOT%0A          + record     = "node_namespace_pod_container:container_memory_working_set_bytes"%0A        }%0A      + rule {%0A          + enabled    = true%0A          + expression = <<-EOT%0A                container_memory_rss{job="cadvisor", image!=""}* on (namespace, pod) group_left(node) topk by(namespace, pod) (1,  max by(namespace, pod, node) (kube_pod_info{node!=""}))%0A            EOT%0A          + record     = "node_namespace_pod_container:container_memory_rss"%0A        }%0A      + rule {%0A          + enabled    = true%0A          + expression = <<-EOT%0A                container_memory_cache{job="cadvisor", image!=""}* on (namespace, pod) group_left(node) topk by(namespace, pod) (1,  max by(namespace, pod, node) (kube_pod_info{node!=""}))%0A            EOT%0A          + record     = "node_namespace_pod_container:container_memory_cache"%0A        }%0A      + rule {%0A          + enabled    = true%0A          + expression = <<-EOT%0A                container_memory_swap{job="cadvisor", image!=""}* on (namespace, pod) group_left(node) topk by(namespace, pod) (1,  max by(namespace, pod, node) (kube_pod_info{node!=""}))%0A            EOT%0A          + record     = "node_namespace_pod_container:container_memory_swap"%0A        }%0A      + rule {%0A          + enabled    = true%0A          + expression = <<-EOT%0A                kube_pod_container_resource_requests{resource="memory",job="kube-state-metrics"}  * on (namespace, pod, cluster)group_left() max by (namespace, pod, cluster) (  (kube_pod_status_phase{phase=~"Pending|Running"} == 1))%0A            EOT%0A          + record     = "cluster:namespace:pod_memory:active:kube_pod_container_resource_requests"%0A        }%0A      + rule {%0A          + enabled    = true%0A          + expression = <<-EOT%0A                sum by (namespace, cluster) (    sum by (namespace, pod, cluster) (        max by (namespace, pod, container, cluster) (          kube_pod_container_resource_requests{resource="memory",job="kube-state-metrics"}        ) * on(namespace, pod, cluster) group_left() max by (namespace, pod, cluster) (          kube_pod_status_phase{phase=~"Pending|Running"} == 1        )    ))%0A            EOT%0A          + record     = "namespace_memory:kube_pod_container_resource_requests:sum"%0A        }%0A      + rule {%0A          + enabled    = true%0A          + expression = <<-EOT%0A                kube_pod_container_resource_requests{resource="cpu",job="kube-state-metrics"}  * on (namespace, pod, cluster)group_left() max by (namespace, pod, cluster) (  (kube_pod_status_phase{phase=~"Pending|Running"} == 1))%0A            EOT%0A          + record     = "cluster:namespace:pod_cpu:active:kube_pod_container_resource_requests"%0A        }%0A      + rule {%0A          + enabled    = true%0A          + expression = <<-EOT%0A                sum by (namespace, cluster) (    sum by (namespace, pod, cluster) (        max by (namespace, pod, container, cluster) (          kube_pod_container_resource_requests{resource="cpu",job="kube-state-metrics"}        ) * on(namespace, pod, cluster) group_left() max by (namespace, pod, cluster) (          kube_pod_status_phase{phase=~"Pending|Running"} == 1        )    ))%0A            EOT%0A          + record     = "namespace_cpu:kube_pod_container_resource_requests:sum"%0A        }%0A      + rule {%0A          + enabled    = true%0A          + expression = <<-EOT%0A                kube_pod_container_resource_limits{resource="memory",job="kube-state-metrics"}  * on (namespace, pod, cluster)group_left() max by (namespace, pod, cluster) (  (kube_pod_status_phase{phase=~"Pending|Running"} == 1))%0A            EOT%0A          + record     = "cluster:namespace:pod_memory:active:kube_pod_container_resource_limits"%0A        }%0A      + rule {%0A          + enabled    = true%0A          + expression = <<-EOT%0A                sum by (namespace, cluster) (    sum by (namespace, pod, cluster) (        max by (namespace, pod, container, cluster) (          kube_pod_container_resource_limits{resource="memory",job="kube-state-metrics"}        ) * on(namespace, pod, cluster) group_left() max by (namespace, pod, cluster) (          kube_pod_status_phase{phase=~"Pending|Running"} == 1        )    ))%0A            EOT%0A          + record     = "namespace_memory:kube_pod_container_resource_limits:sum"%0A        }%0A      + rule {%0A          + enabled    = true%0A          + expression = <<-EOT%0A                kube_pod_container_resource_limits{resource="cpu",job="kube-state-metrics"}  * on (namespace, pod, cluster)group_left() max by (namespace, pod, cluster) ( (kube_pod_status_phase{phase=~"Pending|Running"} == 1) )%0A            EOT%0A          + record     = "cluster:namespace:pod_cpu:active:kube_pod_container_resource_limits"%0A        }%0A      + rule {%0A          + enabled    = true%0A          + expression = <<-EOT%0A                sum by (namespace, cluster) (    sum by (namespace, pod, cluster) (        max by (namespace, pod, container, cluster) (          kube_pod_container_resource_limits{resource="cpu",job="kube-state-metrics"}        ) * on(namespace, pod, cluster) group_left() max by (namespace, pod, cluster) (          kube_pod_status_phase{phase=~"Pending|Running"} == 1        )    ))%0A            EOT%0A          + record     = "namespace_cpu:kube_pod_container_resource_limits:sum"%0A        }%0A      + rule {%0A          + enabled    = true%0A          + expression = <<-EOT%0A                max by (cluster, namespace, workload, pod) (  label_replace(    label_replace(      kube_pod_owner{job="kube-state-metrics", owner_kind="ReplicaSet"},      "replicaset", "$1", "owner_name", "(.*)"    ) * on(replicaset, namespace) group_left(owner_name) topk by(replicaset, namespace) (      1, max by (replicaset, namespace, owner_name) (        kube_replicaset_owner{job="kube-state-metrics"}      )    ),    "workload", "$1", "owner_name", "(.*)"  ))%0A            EOT%0A          + labels     = {%0A              + "workload_type" = "deployment"%0A            }%0A          + record     = "namespace_workload_pod:kube_pod_owner:relabel"%0A        }%0A      + rule {%0A          + enabled    = true%0A          + expression = <<-EOT%0A                max by (cluster, namespace, workload, pod) (  label_replace(    kube_pod_owner{job="kube-state-metrics", owner_kind="DaemonSet"},    "workload", "$1", "owner_name", "(.*)"  ))%0A            EOT%0A          + labels     = {%0A              + "workload_type" = "daemonset"%0A            }%0A          + record     = "namespace_workload_pod:kube_pod_owner:relabel"%0A        }%0A      + rule {%0A          + enabled    = true%0A          + expression = <<-EOT%0A                max by (cluster, namespace, workload, pod) (  label_replace(    kube_pod_owner{job="kube-state-metrics", owner_kind="StatefulSet"},    "workload", "$1", "owner_name", "(.*)"  ))%0A            EOT%0A          + labels     = {%0A              + "workload_type" = "statefulset"%0A            }%0A          + record     = "namespace_workload_pod:kube_pod_owner:relabel"%0A        }%0A      + rule {%0A          + enabled    = true%0A          + expression = <<-EOT%0A                max by (cluster, namespace, workload, pod) (  label_replace(    kube_pod_owner{job="kube-state-metrics", owner_kind="Job"},    "workload", "$1", "owner_name", "(.*)"  ))%0A            EOT%0A          + labels     = {%0A              + "workload_type" = "job"%0A            }%0A          + record     = "namespace_workload_pod:kube_pod_owner:relabel"%0A        }%0A      + rule {%0A          + enabled    = true%0A          + expression = <<-EOT%0A                sum(  node_memory_MemAvailable_bytes{job="node"} or  (    node_memory_Buffers_bytes{job="node"} +    node_memory_Cached_bytes{job="node"} +    node_memory_MemFree_bytes{job="node"} +    node_memory_Slab_bytes{job="node"}  )) by (cluster)%0A            EOT%0A          + record     = ":node_memory_MemAvailable_bytes:sum"%0A        }%0A      + rule {%0A          + enabled    = true%0A          + expression = <<-EOT%0A                sum(rate(node_cpu_seconds_total{job="node",mode!="idle",mode!="iowait",mode!="steal"}[5m])) by (cluster) /count(sum(node_cpu_seconds_total{job="node"}) by (cluster, instance, cpu)) by (cluster)%0A            EOT%0A          + record     = "cluster:node_cpu:ratio_rate5m"%0A        }%0A    }%0A%0A  # module.rule-groups.azurerm_monitor_alert_prometheus_rule_group.node_recording_rules_rule_group will be created%0A  + resource "azurerm_monitor_alert_prometheus_rule_group" "node_recording_rules_rule_group" {%0A      + cluster_name        = "freundcloudaks"%0A      + description         = "Node Recording Rules Rule Group"%0A      + id                  = (known after apply)%0A      + interval            = "PT1M"%0A      + location            = "uksouth"%0A      + name                = "NodeRecordingRulesRuleGroup-freundcloudaks"%0A      + resource_group_name = "rg-freundcloudaks"%0A      + rule_group_enabled  = true%0A      + scopes              = (known after apply)%0A%0A      + rule {%0A          + enabled    = true%0A          + expression = <<-EOT%0A                count without (cpu, mode) (  node_cpu_seconds_total{job="node",mode="idle"})%0A            EOT%0A          + record     = "instance:node_num_cpu:sum"%0A        }%0A      + rule {%0A          + enabled    = true%0A          + expression = <<-EOT%0A                1 - avg without (cpu) (  sum without (mode) (rate(node_cpu_seconds_total{job="node", mode=~"idle|iowait|steal"}[5m])))%0A            EOT%0A          + record     = "instance:node_cpu_utilisation:rate5m"%0A        }%0A      + rule {%0A          + enabled    = true%0A          + expression = <<-EOT%0A                (  node_load1{job="node"}/  instance:node_num_cpu:sum{job="node"})%0A            EOT%0A          + record     = "instance:node_load1_per_cpu:ratio"%0A        }%0A      + rule {%0A          + enabled    = true%0A          + expression = <<-EOT%0A                1 - (  (    node_memory_MemAvailable_bytes{job="node"}    or    (      node_memory_Buffers_bytes{job="node"}      +      node_memory_Cached_bytes{job="node"}      +      node_memory_MemFree_bytes{job="node"}      +      node_memory_Slab_bytes{job="node"}    )  )/  node_memory_MemTotal_bytes{job="node"})%0A            EOT%0A          + record     = "instance:node_memory_utilisation:ratio"%0A        }%0A      + rule {%0A          + enabled    = true%0A          + expression = <<-EOT%0A                rate(node_vmstat_pgmajfault{job="node"}[5m])%0A            EOT%0A          + record     = "instance:node_vmstat_pgmajfault:rate5m"%0A        }%0A      + rule {%0A          + enabled    = true%0A          + expression = <<-EOT%0A                rate(node_disk_io_time_seconds_total{job="node", device!=""}[5m])%0A            EOT%0A          + record     = "instance_device:node_disk_io_time_seconds:rate5m"%0A        }%0A      + rule {%0A          + enabled    = true%0A          + expression = <<-EOT%0A                rate(node_disk_io_time_weighted_seconds_total{job="node", device!=""}[5m])%0A            EOT%0A          + record     = "instance_device:node_disk_io_time_weighted_seconds:rate5m"%0A        }%0A      + rule {%0A          + enabled    = true%0A          + expression = <<-EOT%0A                sum without (device) (  rate(node_network_receive_bytes_total{job="node", device!="lo"}[5m]))%0A            EOT%0A          + record     = "instance:node_network_receive_bytes_excluding_lo:rate5m"%0A        }%0A      + rule {%0A          + enabled    = true%0A          + expression = <<-EOT%0A                sum without (device) (  rate(node_network_transmit_bytes_total{job="node", device!="lo"}[5m]))%0A            EOT%0A          + record     = "instance:node_network_transmit_bytes_excluding_lo:rate5m"%0A        }%0A      + rule {%0A          + enabled    = true%0A          + expression = <<-EOT%0A                sum without (device) (  rate(node_network_receive_drop_total{job="node", device!="lo"}[5m]))%0A            EOT%0A          + record     = "instance:node_network_receive_drop_excluding_lo:rate5m"%0A        }%0A      + rule {%0A          + enabled    = true%0A          + expression = <<-EOT%0A                sum without (device) (  rate(node_network_transmit_drop_total{job="node", device!="lo"}[5m]))%0A            EOT%0A          + record     = "instance:node_network_transmit_drop_excluding_lo:rate5m"%0A        }%0A    }%0A%0A  # module.ssh-key.azapi_resource.ssh_public_key will be created%0A  + resource "azapi_resource" "ssh_public_key" {%0A      + body                      = jsonencode({})%0A      + id                        = (known after apply)%0A      + ignore_casing             = false%0A      + ignore_missing_property   = true%0A      + location                  = "uksouth"%0A      + name                      = (known after apply)%0A      + output                    = (known after apply)%0A      + parent_id                 = (known after apply)%0A      + removing_special_chars    = false%0A      + schema_validation_enabled = true%0A      + type                      = "Microsoft.Compute/sshPublicKeys@2022-11-01"%0A    }%0A%0A  # module.ssh-key.azapi_resource_action.ssh_public_key_gen will be created%0A  + resource "azapi_resource_action" "ssh_public_key_gen" {%0A      + action                 = "generateKeyPair"%0A      + id                     = (known after apply)%0A      + method                 = "POST"%0A      + output                 = (known after apply)%0A      + resource_id            = (known after apply)%0A      + response_export_values = [%0A          + "publicKey",%0A          + "privateKey",%0A        ]%0A      + type                   = "Microsoft.Compute/sshPublicKeys@2022-11-01"%0A      + when                   = "apply"%0A    }%0A%0A  # module.ssh-key.random_pet.ssh_key_name will be created%0A  + resource "random_pet" "ssh_key_name" {%0A      + id        = (known after apply)%0A      + length    = 2%0A      + prefix    = "ssh"%0A        # (1 unchanged attribute hidden)%0A    }%0A%0A  # module.user_assigned_identity.azurerm_user_assigned_identity.msi will be created%0A  + resource "azurerm_user_assigned_identity" "msi" {%0A      + client_id           = (known after apply)%0A      + id                  = (known after apply)%0A      + location            = "uksouth"%0A      + name                = "uai-olafkfreund-dev"%0A      + principal_id        = (known after apply)%0A      + resource_group_name = "rg-freundcloudaks"%0A      + tags                = {%0A          + "application" = "freundcloudaks"%0A          + "environment" = "dev"%0A          + "owner"       = "olafkfreund"%0A        }%0A      + tenant_id           = (known after apply)%0A    }%0A%0APlan: 19 to add, 0 to change, 0 to destroy.%0A%0AChanges to Outputs:%0A  + kube_config         = (sensitive value)%0A  + resource_group_name = "rg-freundcloudaks"%0A
::debug::stderr: 
::debug::exitcode: 0
```
</details>